In [1]:
import numpy as np
import pandas as pd
import sqlite3

s1 = pd.Series([0.2, 0.8, 4.2, 3.1, 2.1], index=['a', 'b', 'c', 'd', 'e'])
d = {'a' : 0., 'b' : 1., 'c' : 2., 'e': 3., 'f': 4.}
s2 = pd.Series(d)

In [2]:
s1

a    0.2
b    0.8
c    4.2
d    3.1
e    2.1
dtype: float64

In [3]:
s2

a    0.0
b    1.0
c    2.0
e    3.0
f    4.0
dtype: float64

In [4]:
s1[s1 < 3]

a    0.2
b    0.8
e    2.1
dtype: float64

In [5]:
s1[[True, True, False, True, False]]

a    0.2
b    0.8
d    3.1
dtype: float64

In [6]:
s1 + s2

a    0.2
b    1.8
c    6.2
d    NaN
e    5.1
f    NaN
dtype: float64

In [7]:
(s1+s2).isnull()

a    False
b    False
c    False
d     True
e    False
f     True
dtype: bool

In [8]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
df1 = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
df1

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [9]:
df1.describe()

              year       wins     losses
count     8.000000   8.000000   8.000000
mean   2011.125000   9.375000   6.625000
std       0.834523   3.377975   3.377975
min    2010.000000   4.000000   1.000000
25%    2010.750000   7.500000   5.000000
50%    2011.000000  10.000000   6.000000
75%    2012.000000  11.000000   8.500000
max    2012.000000  15.000000  12.000000

In [10]:
db = sqlite3.connect(':memory:')
cursor = db.cursor()

cursor.execute('''CREATE TABLE football(id INTEGER PRIMARY KEY, years INTEGER, team TEXT, wins INTEGER, losses INTEGER)''')

data = [(0, 2010, 'Bears', 11, 5), (1, 2011, 'Bears', 8, 8), (2, 2012, 'Bears', 10, 6), (3, 2011, 'Packers', 15, 1),
        (4, 2012, 'Packers', 11, 5), (5, 2010, 'Lions', 6, 10), (6, 2011, 'Lions', 10, 6), (7, 2012, 'Lions', 4, 12)]
cursor.executemany('''INSERT INTO football VALUES(?,?,?,?,?)''', data)

db.commit()

In [11]:
### This query simply prints out everything in the table
cursor.execute('''select * from football''').fetchall()

[(0, 2010, 'Bears', 11, 5),
 (1, 2011, 'Bears', 8, 8),
 (2, 2012, 'Bears', 10, 6),
 (3, 2011, 'Packers', 15, 1),
 (4, 2012, 'Packers', 11, 5),
 (5, 2010, 'Lions', 6, 10),
 (6, 2011, 'Lions', 10, 6),
 (7, 2012, 'Lions', 4, 12)]

In [13]:
cursor.execute('''select max(wins) from football''').fetchall()

[(15,)]

In [14]:
cursor.execute('''select * from football where wins > 10''').fetchall()

[(0, 2010, 'Bears', 11, 5),
 (3, 2011, 'Packers', 15, 1),
 (4, 2012, 'Packers', 11, 5)]

In [15]:
df1[df1.wins>10]

   year     team  wins  losses
0  2010    Bears    11       5
3  2011  Packers    15       1
4  2012  Packers    11       5

In [16]:
df1['wins'] > 10

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
Name: wins, dtype: bool

In [18]:
df1['losses']

0     5
1     8
2     6
3     1
4     5
5    10
6     6
7    12
Name: losses, dtype: int64

In [19]:
cursor.execute('''select losses from football''').fetchall()

[(5,), (8,), (6,), (1,), (5,), (10,), (6,), (12,)]

In [20]:
cursor.execute('''select id,losses from football''').fetchall()

[(0, 5), (1, 8), (2, 6), (3, 1), (4, 5), (5, 10), (6, 6), (7, 12)]

# Your Workspace

In [ ]:
df2 = pd.DataFrame({ 'A' : 1.,
                            'B' : pd.Timestamp('20130102'),
                            'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                            'D' : np.array([3] * 4,dtype='int32'),
                            'E' : pd.Categorical(["test","train","test","train"]),
                            'F' : 'foo' })

In [ ]:
df2